/*
利用 malloc 配置 10 個放學號 (891506101 到 891506110) 的位址
使用 scanf 要求讀入一 1-10 的數, 依讀入把學號印出 
*/
main(){
        int n;
        char *p;
        p =(char *)malloc(10 * 9 * sizeof(char));

        strcpy (p   ,"891516101");*(p+  9)='\0';
        strcpy (p+10,"891516102");*(p+ 19)='\0';
        strcpy (p+20,"891516103");*(p+ 29)='\0';
        strcpy (p+30,"891516104");*(p+ 39)='\0';
        strcpy (p+40,"891516105");*(p+ 49)='\0';
        strcpy (p+50,"891516106");*(p+ 59)='\0';
        strcpy (p+60,"891516107");*(p+ 69)='\0';
        strcpy (p+70,"891516108");*(p+ 79)='\0';
        strcpy (p+80,"891516109");*(p+ 89)='\0';
        strcpy (p+90,"891516110");*(p+ 99)='\0';

        printf("pls input number1-10:");scanf("%d",&n);
        printf("num = %d id is %s\n",n,p+10*(n-1));
}
